using System.Collections.Generic;

namespace stutvds.Constants
{
    public static class Triggers
    {

        public static List<string> GetTriggers_A()
        {
            return new List<string>()
            {
                "апельсин", "атом", "артиллерия", "аист", "айва", "аэропорт", "афиша", "аквариум", "ананас", "актив",
                "алфавит", "адаптация", "анализ", "адрес", "автор", "артист", "архив", "алмаз", "акция", "анекдот",
                "амбулатория", "автопилот", "авангард", "арена", "архитектор", "аналогия", "акробат", "ассоциация",
                "аннотация", "адаптер",
                "аппарат", "анестезия", "аромат", "автомобиль", "антураж", "афоризм", "аптека", "архипелаг",
                "антивирус", "альтернатива",
                "астрономия", "авангардизм", "антидот", "абсолют", "авиация", "администрация", "артель",
                "аккомпанемент", "анонсим", "акцент",
                "адреналин", "архивариус", "аристократ", "анализатор", "абонемент", "альбом", "анархия", "активист",
                "аплодисменты", "арбитраж",
                "аврал", "агрессия", "альпинизм", "анализировать", "актуальность", "адвокат", "архаизм", "апатия",
                "аннотация", "аллегория",
                "ассортимент", "абстракция", "апелляция", "археология", "антенна", "арка", "автограф", "аккредитация",
                "аэробика", "актуализация",
                "архипелаг", "апогей", "альтернатива", "арсенал", "анестезировать", "автономия", "артикуляция",
                "апартаменты", "анализировать", "анализатор",
                "авиатор", "арктика", "аналог", "аккумулятор", "антиген", "авторитет", "артиллерист", "аппаратчик",
                "аккомодация", "аристократия"
            };
        }
        
        public static List<string> GetTriggers_O()
        {
            return new List<string>()
            {
                "облако", "обман", "обморок", "обновление", "обогащение", "обозрение", "обоняние", "оборона", "обострение", "обработка",
                "образец", "обращение", "обрезание", "обстоятельство", "обсуждение", "обуздание", "обучение", "обхождение", "объединение", "объявление",
                "обязанность", "объяснение", "оглашение", "оглавление", "ограничение", "ограждение", "одобрение", "ожидание", "озарение", "озвучивание",
                "оздоровление", "озарённость", "озлобление", "ознакомление", "окаменение", "окантовка", "окисление", "оклеветание", "оковы", "окончание",
                "окошечко", "окружение", "окрыление", "оксюморон", "октябрята", "окуна́ние", "оледенение", "олицетворение", "олигархия", "омоложение",
                "омрачение", "омоложение", "онемение", "опалубка", "опасение", "опережение", "описание", "оплата", "оплодотворение", "оповещение",
                "опоздание", "оправдание", "определение", "опровержение", "опускание", "опустошение", "опущение", "опьянение", "оракул", "организация",
                "органы", "оркестровка", "орнамент", "орнаментация", "оружие", "осадок", "освежение", "освещение", "освобождение", "оседание",
                "оскорбление", "осложнение", "осмотрительность", "осмысление", "оснащение", "основатель", "основоположение", "осознание", "остановка", "остекление",
                "остерегание", "осуществление", "отвращение", "отгадка", "отголосок", "отгрузка", "отдаление", "отдых", "отделение", "откровение"
            };
        }
        
        public static List<string> GetTriggers_U()
        {
            return new List<string>()
            {
                "убегание", "убедительность", "убеждение", "убиение", "убожество", "уборка", "убыстрение", "увековечение", "уведомление", "увековечивание",
                "увеличение", "уверенность", "увертюра", "увеселение", "увещевание", "увлажнение", "увлечение", "увлекательность", "увод", "увольнение",
                "уговаривание", "угнетение", "угождение", "уголовщина", "угомонение", "угон", "угождение", "угроза", "угрызение", "углубление",
                "удаление", "ударение", "удачливость", "удвоение", "удел", "удержание", "удивление", "удовлетворение", "удостоверение", "удостоверенность",
                "ужас", "ужесточение", "уживание", "узаконение", "узел", "узкость", "узнавание", "узорчатость", "узурпация", "узышение",
                "уйма", "укатка", "укачивание", "укол", "украшение", "укрепление", "укрощение", "укрупнение", "укрытие", "уксусность",
                "улегание", "улетучивание", "улица", "уловка", "улучшение", "улыбка", "умаление", "умелость", "уменьшение", "умеренность",
                "умиление", "умиротворение", "умножение", "умозаключение", "умолчание", "умонастроение", "умопомрачение", "уморительность", "умудрение", "умышленность",
                "унижение", "универсальность", "унификация", "уничтожение", "унесение", "упадок", "упоминание", "уполномочивание", "упоминание", "употребление",
                "управление", "упрощение", "упрямство", "упряжка", "уравнение", "уравновешенность", "урегулирование", "урезонивание", "уровень", "уродливость"

            };
        }
        
        public static List<string> GetTriggers_E()
        {
            return new List<string>()
            {
                "эгида", "эгоизм", "эгология", "эгрегор", "эдикт", "эволюция", "эвристика", "эвфемизм", "эвфония", "эгалитаризм",
                "эвтаназия", "эглония", "эготизм", "эгомания", "эгоцентризм", "эгоцентричность", "эгономика", "эгология", "эгрегориальность", "эгидация",
                "эволюционизм", "эволюционирование", "эволюционист", "эвристичность", "эвристический", "эвристикация", "эвристичность", "эвфемистичность", "эвфемизация", "эвфемистический",
                "эвфоничность", "эвфонический", "эгалитарность", "эгалитарный", "эдельвейс", "экзальтация", "экзарх", "экзамен", "экзаменация", "экзаменатор",
                "экзекуция", "экзема", "экзистенциализм", "экзистенция", "экзистенциальность", "экзотика", "экзотичность", "экзотический", "экзоскелет", "экзоцитоз",
                "эклиптика", "эклектика", "эклектичность", "эклипс", "эклиматизация", "экологизм", "экологичность", "экологический", "экономия", "экономика",
                "экономист", "экономический", "эконометрия", "эконометрический", "экономизация", "экономичный", "экосистема", "экспансия", "экспансивность", "экспансивный",
                "экспансионизм", "экспат", "экспедиция", "эксперимент", "экспериментатор", "экспериментирование", "экспериментальность", "эксперт", "экспертиза", "экспликация",
                "эксплуатация", "эксплуататор", "эксплуатируемость", "экспозиция", "экспонат", "экспорт", "экспортирование", "экспресс", "экспрессия", "экспрессивность",
                "экспрессивный", "экспрессо", "экспромт", "экспроприация", "эксплуатационный", "экспериментальный", "эксгумация", "экстракт", "экстракция", "экстраверт"


            };
        }
    }
}